// การแปลง String เป็น Int สามารถทำได้ง่ายๆโดยการใส่ + ไว้ด้านหน้า
// Example: +"1" (String) => 1 (Number)
function costToMakeEqual(a, b) {
    // เก็บตัวก่อนหน้าโดยที่ค่านี้จะมีค่าเป็น 0, 1 ส่วน -1 คือตัวก่อนหน้ามัน a[i] == b[i] อยู่แล้ว
    let prev = -1;
    // เก็บค่าผลลัพธ์
    let cost = 0;
    // เริ่มต้น Loop ตั้งแต่ตัวแรกยันตัวสุดท้าย
    for (let i = 0; i < a.length; ++i) {
        // ถ้า a[i] = b[i] อยู่แล้วก็ไม่ต้องทำอะไรข้ามไปได้เลย
        if (a[i] === b[i]) {
            prev = -1;
        } else {
            // ถ้าไม่เท่ากันจะเช็คว่าตัวก่อนหน้ามันมีค่าตรงข้ามกับตัวมันเองรึป่าว
            // ถ้าใช่ก็ไม่ต้องคิด Cost เพิ่มแล้ว (Operation 1)
            if (prev !== -1 && prev !== +a[i]) {
                prev = -1;
            } else {
                // Operation 2
                cost++;
                prev = +a[i];
            }
        }
    }

    return cost;
}